---
type: BRepBuilderSurfaceGeometry
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# BRepBuilderSurfaceGeometry

`Autodesk.Revit.DB.BRepBuilderSurfaceGeometry` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2016 | `public static BRepBuilderSurfaceGeometry Create ( Surface surface , BoundingBoxUV surfaceEnvelope )` |
| Method | CreateNURBSSurface | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |